# BuiltInFailures.InaccurateFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..InaccurateFailures Class
BuiltInFailures Class Members See Also
---
Failures about Inaccurate.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class InaccurateFailures
```

Visual Basic
---
```text
Public NotInheritable Class InaccurateFailures
```

Visual C++
---
```text
public ref class InaccurateFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..InaccurateFailures
# See Also
BuiltInFailures..::..InaccurateFailures Members
Autodesk.Revit.DB Namespace